{
    "post": {
        "title": "Thoughts on the New Apostolic Reformation(NAR)?",
        "author": "Cdude89",
        "author_karma": 48430,
        "author_comment_karma": 3473,
        "body": "My church recently went through a revival week and brought in a lot of speakers from this movement, including Lou Engle. Our preacher has since been adopting their philosophy but, my wife and I, aren't sure their philosophy lines up with scripture. Does anyone have experience with them?",
        "url": "https://www.reddit.com/r/Christianity/comments/1728sg9/thoughts_on_the_new_apostolic_reformationnar/",
        "score": 6,
        "num_comments": 27,
        "created": 1696691830.0,
        "author_flair_text": null,
        "id": "1728sg9",
        "name": "t3_1728sg9",
        "saved": false
    },
    "comments": [
        {
            "author": "Shot_Interaction9933",
            "author_karma": 1,
            "author_comment_karma": 253,
            "id": "k3v54h3",
            "body": "They’re a bunch of raving extremists who want to see Christianity in control of the American government. \n\nThey’re little better than the Taliban in terms of some of their beliefs. It’s specifically concerning how much they use the language of “holy war” in relation to those who don’t agree with them.\n\nNot to mention they use a translation of the Bible that has been demonstrably altered to align with their views.",
            "score": 7,
            "likes": true,
            "created": 1696693244.0,
            "author_flair_text": "Agnostic Atheist",
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "JayMag23",
            "author_karma": 176,
            "author_comment_karma": 2054,
            "id": "k3v9ras",
            "body": "[https://www.bing.com/ck/a?!&&p=1388c26891464354JmltdHM9MTY5NjYzNjgwMCZpZ3VpZD0yYTcyOWIzNi1mODljLTYyMjctMTQ0My04ODA1ZjkzYjYzY2YmaW5zaWQ9NTI3Mg&ptn=3&hsh=3&fclid=2a729b36-f89c-6227-1443-8805f93b63cf&psq=New+Apostalic+Reformation&u=a1aHR0cHM6Ly93d3cuY3Jvc3N3YWxrLmNvbS9jaHVyY2gvcGFzdG9ycy1vci1sZWFkZXJzaGlwL3doYXQtY2hyaXN0aWFucy1uZWVkLXRvLWtub3ctYWJvdXQtdGhlLW5ldy1hcG9zdG9saWMtcmVmb3JtYXRpb24uaHRtbA&ntb=1](https://www.bing.com/ck/a?!&&p=1388c26891464354JmltdHM9MTY5NjYzNjgwMCZpZ3VpZD0yYTcyOWIzNi1mODljLTYyMjctMTQ0My04ODA1ZjkzYjYzY2YmaW5zaWQ9NTI3Mg&ptn=3&hsh=3&fclid=2a729b36-f89c-6227-1443-8805f93b63cf&psq=New+Apostalic+Reformation&u=a1aHR0cHM6Ly93d3cuY3Jvc3N3YWxrLmNvbS9jaHVyY2gvcGFzdG9ycy1vci1sZWFkZXJzaGlwL3doYXQtY2hyaXN0aWFucy1uZWVkLXRvLWtub3ctYWJvdXQtdGhlLW5ldy1hcG9zdG9saWMtcmVmb3JtYXRpb24uaHRtbA&ntb=1)\n\nWhat Christians Need to Know about the New Apostolic Reformation\r  \nClarence L. Haynes Jr.\r  \nContributing Writer\r  \n2021\r  \n30 Mar",
            "score": 5,
            "likes": true,
            "created": 1696695022.0,
            "author_flair_text": "Church of God",
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Coollogin",
            "author_karma": 30,
            "author_comment_karma": 217324,
            "id": "k3ve8lf",
            "body": "Wow. I just did a little Wikipedia sleuthing. Wow.",
            "score": 3,
            "likes": true,
            "created": 1696696729.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Clear-Ad-2578",
            "author_karma": 1,
            "author_comment_karma": 2,
            "id": "krka91u",
            "body": "I have had limited experiences with the NAR churches, but I have some experience with those who have been in NAR—and have been under those people as well. They align with only certain verses in Scripture, and even if they do align with those verses, they do not align with the verses when you are reading the verses in context of the passage/book.\n\nPreachers in this movement are very charismatic in speaking and performance; they persuade well too, especially if they are saying correct things about the Bible and what is coming in the ages. They might present Biblical premises and conclusions (and even points of proof). However, the logic of the points to the conclusion are unbiblical and not theologically sound. *Theology* literally means \"logic of God.\" So, even if they are using Scripture, if they are not using it as God had intended for the Church to use, then they are using the Bible un-theologically—just like cults, and movements (e.g., Nazism).",
            "score": 2,
            "likes": true,
            "created": 1708576148.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Due_Variation7470",
            "author_karma": 31,
            "author_comment_karma": 392,
            "id": "lb3zh8z",
            "body": "They are apostate teachers. Paul warns us in Timothy. They are utterly perverting the Gospel I urge I explore even beg you all to speak out against their lies when you can. Fight the work of the enemy redeem the time for the days are evil! If you don't know how to refute their blasphemous remarks  but you know it doesn't sound right DM me, we can go to the Word together.  Use the Double edge Sword to get at their forked tongues.",
            "score": 2,
            "likes": true,
            "created": 1719832253.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "JumpyAnalyst1598",
            "author_karma": 8,
            "author_comment_karma": 39,
            "id": "l25hw0d",
            "body": "There is an excellent book on this: Counterfeit Kingdom: The Dangers of New Revelation, New Prophets, and New Age Practices in the Church  - written by two academics at Biola.",
            "score": 1,
            "likes": true,
            "created": 1714598366.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Admirable_Aspect_833",
            "author_karma": 1,
            "author_comment_karma": 13,
            "id": "l2wp9v2",
            "body": "NAR is a gnostic-influenced sham that elevates man instead of glorifying God.  Counterfeit Kingdom, as mentioned, is a great book to read on the subject.  It is ruining churches and leading people astray.  Educate yourself as much as possible on it, and run from any church that dabbles in it.",
            "score": 1,
            "likes": true,
            "created": 1715040242.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Mission_Selection_86",
            "author_karma": 1,
            "author_comment_karma": 0,
            "id": "lku5pfc",
            "body": "I was mentored by an NAR \"Apostle\". He called himself my \"spiritual father\", he used my eagerness to know God to put me in a compromised position where he attempted to convince me that God said I needed to sleep with him in order to fully \"receive my healing\". \"A righteous touch \", he called it. He also confessed to having had explicitly sexual dreams about me over the span of the 3 years that he was \"mentoring\" me. Misquoted the story about King David being given a virgin to support his idea. My dad is ordained by FMCI, same group that Dutch Sheets, (Give Him 15), came out of. It's a boys club. On more than one occasion I have heard my own father take up after a convicted rapist, claiming that the woman made him (a married man) believe that she wanted him. 🤮",
            "score": 1,
            "likes": true,
            "created": 1725114790.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "DrPablisimo",
            "author_karma": 639,
            "author_comment_karma": 982,
            "id": "lll7sxh",
            "body": "I believe in Ephesians 4:11 ministry, with an apostolic role being fulfilled by those who are called to plant churches.  I think it can function on the missions field.  \n\nBut it seems like a lot of NAR folks have a very loose fuzzy idea of apostleship--- a combination of 'he's so anointed he's an apostle' and C. Peter Wagoner's idea that an apostle is someone over multiple churches.   IMO, it's adding a layer of unbiblical hierarchy on top of a layer of unbiblical or quasi-biblical hierarchy.  (Where is the 'senior pastor' in scripture?)  \n\nPaul, Silas, and Timothy had a 'measure of rule' that extended to Corinth and the Corinthians, because they had gone as far as Corinth in bringing the gospel of Christ.  They wanted help to go further into new areas, to extend their measure of rule.  Paul goes on to explain how that others who boasted in their labors were fools.  There were people who didn't introduce the Corinthians to Christ who claimed them.   Nevertheless, in his previous epistle, he seemed to include Apollos as an apostle.  Paul wrote that if the Corinthians had 10,000 teachers, but not many fathers.  An NAR interpretation was for their 'apostles' to try to gather pastors under mentors and be a daddy figure to them.  But Paul was a father in the faith to the Corinthians by evangelistically introducing them to Christ, not just by being fatherly in his interactions with them.\n\nPaul called the Corinthian church the seal of his apostleship in the Lord.  They were evidence that God had sent them.  He'd introduced the gospel to them and a new church was formed.  \n\nI've also come across the idea that a church should have a board with at least one apostle, one prophet, one evangelist, one pastor, and one teacher on it governing the church.   Why?  Ephesians 4:11 does not say that these are board member or church government roles.   \n\nApostles had a 'measure of rule' in churches started through their ministry, and the twelve were sent to the nations.   They held a leadership role in the Jerusalem church, but let others take over responsibility.  So, 'apostle' can be a church government role.  But Paul and his co-worker's measure of rule extended to where they had introduced the gospel.  He had a leadership role in Corinth and various other churches.  But in the church in Jerusalem, he listened to the advice of the elders and deferred to their counsel.  \n\nAside from the roles of Father, Son, and Holy Ghost, I'd say that church government roles are\n\n1.  Apostle.  \n2.  Overseer.  \n3.  Brethren.\n\nI might also mention deacon as a role of service, and administrating gifts for widows, for example, involves some administration and decision making.  \n\nIn the Old Testament, 'prophet' was not a government role over the people, though some prophets also held the role of judge or other leadership role.  David was King, for example.  But Jeremiah was not a ruler over the people in the government.  A prophet could be an overseer in the church, but he needs to meet the Biblical qualifications described in I Timothy 3 and Titus 1.  \n\n'Overseer' or bishop is used somewhat interchangeably with 'bishop.'   In Acts 20:28, Paul tells the elders of the Ephesians church to \\_pastor\\_ the church of God over which the Holy Ghost had made them overseers (bishops.)  In I Peter 5 Peter tells elders to pastor the flock of God, taking the oversight thereof.  The gift of pastor and teacher is associated with the eldership role.  But it is conceivable that someone might have this gift but not be qualified for the role, for example, due to lack of life experience, having not yet ruled his house well.\n\nHistorically, elder (priest, derived from presbuteros, translated 'elder' in the New Testament) was the go-to word for the ordained church office.  But in English and German speaking areas, the same word 'priest' was used for descendants of Aaron who ministered in the tabernacle and temple, the kohenim.  The Reformed movement in Geneva took to taking their ordained ministers 'pastors' (or linguistic equivalent) and named their city council leaders 'elders' after another Greek word translated elders 'garousia' modeling a leadership role in 3rd or 4th century Greek-speaking Christian communities in the middle east and north Africa.   This was copied and turned into a national church system by the Presbyterians, where they created the role of unordained board 'elder' and called their clergy 'pastor.'  This has been copied by other Protestant groups in the English-speaking world.\n\nIMO, while there might be some actual apostles in the NAR movement, the doctrine of apostleship is rather fuzzy in the movement, from what I've heard and read, and doesn't align that well with scripture.",
            "score": 1,
            "likes": true,
            "created": 1725516243.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "jontruth",
            "author_karma": 449,
            "author_comment_karma": 672,
            "id": "lujm9zi",
            "body": "Lou Engle is friends with Jimmy Seibert, the founder of The Antioch International Movement of Churches which is rooted in NAR teachings. Lou Engle is on the [SPLC's Hatewatch Extremist](https://www.splcenter.org/fighting-hate/extremist-files/individual/lou-engle) list for calling for death to homosexuals. The Antioch Movement churches endorse conversion therapy ministry. \n\nNew Apostolic Reformation churches like The Antioch International Movement of Churches deviate from traditional Christian theology and practices. The movement’s emphasis on extra-biblical revelation, dominionism, and supersessionism is unbiblical and leads to a rejection of Scripture as the sole authority for Christian living. While some Christians within the NAR movement may hold to more traditional theological views, the movement as a whole has been criticized for its lack of accountability, inadequate biblical grounding, and association with questionable spiritually abusive leaders.",
            "score": 1,
            "likes": true,
            "created": 1730305500.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "JohnDoughboy7363",
            "author_karma": 1,
            "author_comment_karma": -16,
            "id": "lxem665",
            "body": "I have to come out at some point about the Nar Doctrine destroying my life in 2020.  Kat Kerr, Hank Kunneman, Kim Clement are all false prophets.",
            "score": 1,
            "likes": true,
            "created": 1731746181.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Diligent_Cook_579",
            "author_karma": 1,
            "author_comment_karma": -2,
            "id": "lyqraq2",
            "body": "Is a false movement, I have seen its leaders grow a base from the beginning:\nA false church bringing about the antiChrist, read your bible and test the spirits. \nBook of revelation: the beast going conquering and to conquer, the woman (false religious system) riding the beast and later being consumed by it. \n1 Timothy: a great falling away led by seducing spirits and doctrines of demons. \nWe do not establish a “Christian” kingdom in this earth for Christ’s return, that is unbiblical and has about the antiChrist and the second beast that has the ability to create a robot that moves and speaks and looks like the beast.  Who has the power to have satellite internet to keep track of everyone on earth and to produce the mark of the beast to be put either on the forehead or hand. \nDo not allow yourself to be deceived. ",
            "score": 1,
            "likes": true,
            "created": 1732458257.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Ok_Contribution_5967",
            "author_karma": 3,
            "author_comment_karma": 1,
            "id": "mc5qf4y",
            "body": "Run!!!",
            "score": 1,
            "likes": true,
            "created": 1739267571.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Nota-Bene-sic-transi",
            "author_karma": 9,
            "author_comment_karma": 16,
            "id": "mkwpxod",
            "body": "they are anywhere from mildly heretical - to seriously heretical. Any group that gets extra-biblical revelation is to be avoided.  the fact that they have spread so alarmingly fast and under the radar is frightening.",
            "score": 1,
            "likes": true,
            "created": 1743536851.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "Nota-Bene-sic-transi",
            "author_karma": 9,
            "author_comment_karma": 16,
            "id": "mkwqawa",
            "body": "Counterfeit Kingdom by Holly Pivec (who is the specialist on them), is very good.  You can catch her on many podcasts and youtube channels.",
            "score": 1,
            "likes": true,
            "created": 1743536964.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "MrsConcreten",
            "author_karma": 1,
            "author_comment_karma": 0,
            "id": "mlvsed5",
            "body": "Has anyone had any experience with NAR people covertly infiltrating churches? We are a small congregation, and we have a couple who don't openly mention NAR, but knowing their previous church, their  beliefs,  the terminology they use,  their push for Graham Cooke books and endorsement of Kathryn Krick they are clearly NAR.  They have the appearance of  Godly Christians, but there has been some very off and concerning behavior.  Quietly making false accusations, sabotaging things while totally kissing up to certain leadership, introducing certain teachings to weaker believers, but very cautious when around those of us who are mature and know our scriptures.  They are not openly pushing an agenda but are subtly trying to implement changes.  I am hoping they are just being fooled themselves and don't have a nefarious agenda, but l can't shake the feeling of concern.  However, if I say anything, the certain leader they are 'courting' will most likely accuse me of being judgmental and not loving. I am not and have not been accused of that before, but I can see the trap being set.  My husband believes (and I am  in agreement) that we need to educate ourselves about this movement, and time/God will hopefully expose them or make it clear they are just confused and need lots of grace and mercy. I am just wondering if this is part of their movement or is this more of an isolated situation?",
            "score": 1,
            "likes": true,
            "created": 1744041891.0,
            "author_flair_text": null,
            "parent_id": "t3_1728sg9"
        },
        {
            "author": "tachibanakanade",
            "author_karma": 32224,
            "author_comment_karma": 87853,
            "id": "k3v7ea1",
            "body": "what translation of the Bible do they use?",
            "score": 2,
            "likes": true,
            "created": 1696694122.0,
            "author_flair_text": "Christian, but still communist",
            "parent_id": "t1_k3v54h3"
        },
        {
            "author": "DrPablisimo",
            "author_karma": 639,
            "author_comment_karma": 982,
            "id": "lll5wso",
            "body": "This is a bizarre definition.  It's what whoever wrote the Wikipedia page went with, the last I heard it.  A more reasonable explanation might start with Peter Wagoner's theory about church government, and Wagoner's idea that 'apostle' means someone over more than one church... something along those lines.\n\nSome NAR folks have sort of post-millennial views about the church, and some are into political activism, but a lot of them expect to see change through 'decreeing and declaring', prayer, etc. probably more so than through political activism.",
            "score": 2,
            "likes": true,
            "created": 1725515099.0,
            "author_flair_text": null,
            "parent_id": "t1_k3v54h3"
        },
        {
            "author": "JohnDoughboy7363",
            "author_karma": 1,
            "author_comment_karma": -16,
            "id": "lxemehh",
            "body": "[https://www.youtube.com/watch?v=QrXi3FgDYhg&t=1436s](https://www.youtube.com/watch?v=QrXi3FgDYhg&t=1436s)\n\nEllis Smith on The Kim Clement Youtube Channel in 2022 explains the Nar Doctrine pretty well in a conversation with Donne Clement and Jane Clement.  The Nar Doctrine destroyed my life and I will come out at some point in the future.  Which eventually driven me mentally ill too.  22:00",
            "score": 2,
            "likes": true,
            "created": 1731746340.0,
            "author_flair_text": null,
            "parent_id": "t1_k3v54h3"
        },
        {
            "author": "Mission_Selection_86",
            "author_karma": 1,
            "author_comment_karma": 0,
            "id": "lku60qw",
            "body": "I have also noticed a very effeminate vibe from the men in these circles. It's very much giving DL. ",
            "score": 1,
            "likes": true,
            "created": 1725114903.0,
            "author_flair_text": null,
            "parent_id": "t1_lku5pfc"
        },
        {
            "author": "Killacourtney",
            "author_karma": 170,
            "author_comment_karma": 152,
            "id": "m9fbum6",
            "body": "Hi there, I know your comment is a few months old, I just thought I’d ask how you’re doing. My marriage and family life are being very strained because I completely left evangelicalism behind. Ironically, it was hearing my wife listen to Kat Kerr that sent me on my journey to leaving the movement, all the way back in 2020. \n\nSteve Shultz is either the most gullible man in the history of humanity or the most evil to have ever existed for giving a platform to some of these apostate “apostles.”",
            "score": 1,
            "likes": true,
            "created": 1737969363.0,
            "author_flair_text": null,
            "parent_id": "t1_lxem665"
        },
        {
            "author": "Shot_Interaction9933",
            "author_karma": 1,
            "author_comment_karma": 253,
            "id": "k3v8wm2",
            "body": "The Passion Translation",
            "score": 1,
            "likes": true,
            "created": 1696694693.0,
            "author_flair_text": "Agnostic Atheist",
            "parent_id": "t1_k3v7ea1"
        },
        {
            "author": "Ok_Contribution_5967",
            "author_karma": 3,
            "author_comment_karma": 1,
            "id": "mc5qmb2",
            "body": "Same with me run from this movement it’s a cult",
            "score": 1,
            "likes": true,
            "created": 1739267696.0,
            "author_flair_text": null,
            "parent_id": "t1_lxemehh"
        },
        {
            "author": "bananarepama",
            "author_karma": 526,
            "author_comment_karma": 27008,
            "id": "mhhlzqa",
            "body": "Is there anything that can be done to counteract its influence?",
            "score": 1,
            "likes": true,
            "created": 1741827919.0,
            "author_flair_text": null,
            "parent_id": "t1_lxemehh"
        },
        {
            "author": "tachibanakanade",
            "author_karma": 32224,
            "author_comment_karma": 87853,
            "id": "k3va76z",
            "body": "ah",
            "score": 1,
            "likes": true,
            "created": 1696695194.0,
            "author_flair_text": "Christian, but still communist",
            "parent_id": "t1_k3v8wm2"
        }
    ]
}