{
    "post": {
        "title": "Christianity VS New Thought",
        "author": "CheekSpreader91",
        "author_karma": 152,
        "author_comment_karma": 198,
        "body": "I'm having some difficulty discerning Biblical Christianity from New Thought Movement literature and speakers who have a different interpretation of the Bible. My problem is that I've always believed in Biblical Christianity (I mean, not perfect by any means) but the New Thought take on it just sounds so intellectual and well-thought-out. It makes too much sense, but almost completely throws away the idea of God's existence as a being in the Biblical sense, and makes it seem like God is merely the term for all of existence. What are your thoughts on this?",
        "url": "https://www.reddit.com/r/Christianity/comments/1h44z9g/christianity_vs_new_thought/",
        "score": 1,
        "num_comments": 20,
        "created": 1733064949.0,
        "author_flair_text": null,
        "id": "1h44z9g",
        "name": "t3_1h44z9g",
        "saved": false
    },
    "comments": [
        {
            "author": "[deleted]",
            "author_karma": 0,
            "author_comment_karma": 0,
            "id": "lzvl77e",
            "body": "https://www.reddit.com/r/Occult_to_Christ/s/OnVBe7B8tG",
            "score": 2,
            "likes": null,
            "created": 1733065033.0,
            "author_flair_text": null,
            "parent_id": "t3_1h44z9g"
        },
        {
            "author": "FragmentedCoast",
            "author_karma": 3,
            "author_comment_karma": 2599,
            "id": "lzvlxta",
            "body": "How is \"New Thought movement\" defined? I've not come across that before",
            "score": 2,
            "likes": null,
            "created": 1733065308.0,
            "author_flair_text": "Christian",
            "parent_id": "t3_1h44z9g"
        },
        {
            "author": "TACK_OVERFLOW",
            "author_karma": 7,
            "author_comment_karma": 17514,
            "id": "lzvn8kk",
            "body": "Do you have any examples in mind where New thought differs from traditional Christianity?",
            "score": 2,
            "likes": null,
            "created": 1733065786.0,
            "author_flair_text": null,
            "parent_id": "t3_1h44z9g"
        },
        {
            "author": "Coollogin",
            "author_karma": 30,
            "author_comment_karma": 217324,
            "id": "lzvroec",
            "body": "When you say “New Thought,” are you talking about this: https://en.wikipedia.org/wiki/New_Thought ?\n\n> makes it seem like God is merely the term for all of existence\n\nI am an atheist, and I come across these guys sometimes? I find them annoying. We already have a term for “all of existence.” It’s “all of existence”!",
            "score": 1,
            "likes": null,
            "created": 1733067345.0,
            "author_flair_text": null,
            "parent_id": "t3_1h44z9g"
        },
        {
            "author": "TheTallestTim",
            "author_karma": 3078,
            "author_comment_karma": 5257,
            "id": "lzx7att",
            "body": "Soooo the Trinity is not Biblical Christianity as much as they *love* to say it is. Trinity is not mentioned anywhere in the Bible, neither is the explanation of the Trinity found anywhere in the Bible. Instead, Jesus says he has a God, namely the Father. (John 17:3; 20:17) As does Paul. (1Cor 15:24) Simply, Almighty God does not have a god. Full stop. “Only in the flesh” is the weakest most used argument in all Christendom.. become educated in the Bible before making a claim… **PLEASE**\n\nI am offering my perspective based on my involvement in the conversation.",
            "score": 1,
            "likes": null,
            "created": 1733083475.0,
            "author_flair_text": "Christian (Pre-existance Unitarianism)",
            "parent_id": "t3_1h44z9g"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzvq2iz",
            "body": "Thank you very much.",
            "score": 1,
            "likes": null,
            "created": 1733066786.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvl77e"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzvqmcw",
            "body": "Basically it's the underlying principles described in one of the original self-help books, \"Psycho Cybernetics\" from 1960s. Another one is \"The Power of Now\" by Eckert Toll. This style of self-help sounds really good to people who don't know what they believe. I've read a few similar books, just to see what the hype is about. They all basically point to man being our own Creators and that our thoughts determine and shape our entire destiny, with \"God\" simply being a term for the fabric of the Universe and all things that were ever created. But they seem to all point to Jesus as simply a very enlightened individual who \"freed minds\" similar to the Matrix movies.",
            "score": 1,
            "likes": null,
            "created": 1733066980.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvlxta"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzvqv8z",
            "body": "Yes. The parts where they describe Jesus Christ as simply an \"enlightened and spiritually aware\" individual who simply opened minds like the Matrix. Or how the entire reality we live in is shaped from our thoughts, and we all have \"Divine essence\" within and are our own makers and creators. Etc.",
            "score": 1,
            "likes": null,
            "created": 1733067067.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvn8kk"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzvu88t",
            "body": "I see. And as a Christian with an open mind, I've read some of their literature. I guess you could say I enjoy their literature, but it would feel like I'm separating myself from Christ to take any of it seriously. I'd like to find a way to test it without giving up my own beliefs. I suppose I should study the Bible more and try to find more verses on man and his thoughts, if they exist. Or how thoughts vs desires vs beliefs interact. Maybe I'm amazed intellectually at the New Thought ideas, but hold firm with my faith. Like a conflict of interests. It would seem that we do, in fact, hold a lot of power in our thoughts and what we manifest in our lives. At the same time, it would seem that my limited knowledge of the Bible, as a general believer, would lead me to think that any form of thought similar to New Age would be a direct abandonment from God.",
            "score": 1,
            "likes": null,
            "created": 1733068215.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvroec"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzxenbx",
            "body": "I'm not sure I understand your comment. The whole part of my original post is stating that the New Thought refers to Jesus Christ as simply a man, who was enlightened, and insinuates that the miracles weren't literal but metaphorical, whereas I do like some of the New Thought ideas. I can't commit to those ideas, however, because as a Christian who's read a lot of the Bible, I believe that Jesus is in fact the embodiment of God who rose again, who answers only to the Almighty God, who is omnipotent and not merely a slang word for universal fabric and existence, as New Thought says.",
            "score": 1,
            "likes": null,
            "created": 1733085731.0,
            "author_flair_text": null,
            "parent_id": "t1_lzx7att"
        },
        {
            "author": "FragmentedCoast",
            "author_karma": 3,
            "author_comment_karma": 2599,
            "id": "lzvyyec",
            "body": "Thanks for taking the time to provide a synopsis. I have heard of Toll. \n\nWhen the bible talks about being people with itching ears being led astray, he's one that comes to mind.",
            "score": 2,
            "likes": null,
            "created": 1733069799.0,
            "author_flair_text": "Christian",
            "parent_id": "t1_lzvqmcw"
        },
        {
            "author": "Coollogin",
            "author_karma": 30,
            "author_comment_karma": 217324,
            "id": "lzvvkl7",
            "body": ">And as a Christian with an open mind, I've read some of their literature. I guess you could say I enjoy their literature, but it would feel like I'm separating myself from Christ to take any of it seriously.\n\nI think it’s possible to have a deep interest in a religion/philosophy that is not your own. There are Christian scholars of Islam. There are Jewish scholars of Christianity. There are atheists of Jewish heritage who study the ultra Orthodox Jewish sects. And so on and so on. Basically, all these folks are examining the other groups as an anthropologist would, and reason their texts as a historian would.",
            "score": 2,
            "likes": null,
            "created": 1733068676.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvu88t"
        },
        {
            "author": "TheTallestTim",
            "author_karma": 3078,
            "author_comment_karma": 5257,
            "id": "m04ntyb",
            "body": "That’s wild. I’ve never heard of that. How is that supported Biblically?\n\nI guarantee that you have not read a lot of Bible. If you had, truly *read* the Bible, you would see a hierarchy of the Father *over* the Son. (1Cor 11:3; John 20:17) Jesus is not coequal with the Father ever in the Bible. Even if you find one or two, there is still quantifiable more proof that Jesus is lower than the Father.",
            "score": 1,
            "likes": null,
            "created": 1733188179.0,
            "author_flair_text": "Christian (Pre-existance Unitarianism)",
            "parent_id": "t1_lzxenbx"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzw0mzl",
            "body": "Makes good sense. But I'm after more of the \"should I pursue anything at all?\" because \"God is in total control\" and \"I'm not in control of anything\" so where does that put our personal responsibility at?",
            "score": 1,
            "likes": null,
            "created": 1733070353.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvyyec"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzvy18o",
            "body": "My main conundrum with this is that I kind of do believe that what we think of is ultimately what we're going to manifest just by default. At the same time, it seems like all Biblical Word advocates that we have zero control over our own lives, destiny, or outcomes and to fully trust God and turn it entirely over, because we are nothing in comparison. But, Proverbs also speaks about making good choices and weighing consequences. NTM/NAT suggests that we are 100% in control.",
            "score": 1,
            "likes": null,
            "created": 1733069499.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvvkl7"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "m04oxab",
            "body": "I'm even more confused now. I think you're entirely misunderstanding what I'm typing. Jesus. The embodiment of God in the flesh. God impregnated Mary. Mary gave birth to Jesus. Jesus is the only man born of a virgin. God is His biological father, and I said Jesus is the embodiment of the Spirit of God, in a human body. And I also said that Jesus answers ONLY to Almighty God. As in, Jesus is above answering to men, but answers to God, because God is over the son.",
            "score": 1,
            "likes": null,
            "created": 1733188572.0,
            "author_flair_text": null,
            "parent_id": "t1_m04ntyb"
        },
        {
            "author": "Coollogin",
            "author_karma": 30,
            "author_comment_karma": 217324,
            "id": "lzwche3",
            "body": "> My main conundrum with this is that I kind of do believe that what we think of is ultimately what we're going to manifest just by default.\n\nWould it be helpful to you if someone could point out the flaws in that belief, allowing you to let go of them? Or do you feel an attachment to your belief, such that you wouldn’t want to lose it?",
            "score": 1,
            "likes": null,
            "created": 1733074112.0,
            "author_flair_text": null,
            "parent_id": "t1_lzvy18o"
        },
        {
            "author": "TheTallestTim",
            "author_karma": 3078,
            "author_comment_karma": 5257,
            "id": "m0mdwov",
            "body": "How is what I said confusing?\n\nHow can you be the Father of yourself?\n\nThe Father cannot be over the Son in the Trinity. The Trinity states that the Father, Son, and Spirit are coeternal and coequal..",
            "score": 1,
            "likes": null,
            "created": 1733441374.0,
            "author_flair_text": "Christian (Pre-existance Unitarianism)",
            "parent_id": "t1_m04oxab"
        },
        {
            "author": "CheekSpreader91",
            "author_karma": 152,
            "author_comment_karma": 198,
            "id": "lzwjesv",
            "body": "It would be great to see the pros and cons and discern truths about manifestation.",
            "score": 1,
            "likes": null,
            "created": 1733076222.0,
            "author_flair_text": null,
            "parent_id": "t1_lzwche3"
        },
        {
            "author": "Coollogin",
            "author_karma": 30,
            "author_comment_karma": 217324,
            "id": "lzwk93j",
            "body": "> It would be great to see the pros and cons and discern truths about manifestation.\n\nYou might try posting about it to r/DebateAnAtheist or r/DebateReligion. Maybe if people can point out the flaws in your belief in manifestation, then you will be rid of the conflict between your manifestation beliefs and your Biblical beliefs.",
            "score": 2,
            "likes": null,
            "created": 1733076490.0,
            "author_flair_text": null,
            "parent_id": "t1_lzwjesv"
        }
    ]
}